43_cache_dep/basic/controllers/CommonController.php

SELECT * FROM `shop_cart` WHERE userid = '12'
SELECT * FROM `shop_product` WHERE productid = '27'
---
    public function init()
    {
        // 菜单缓存
        $cache = Yii::$app->cache;
        $key = 'menu';
        if (!$menu = $cache->get($key)) {
            $menu = Category::getMenu();
            $cache->set($key, $menu, 3600*2);
        }
        $this->view->params['menu'] = $menu;

        // 购物车缓存
        $key = "cart";
        if (!$data = $cache->get($key)) {
            $data = [];
            $data['products'] = [];
            $total = 0;
            $userid = Yii::$app->user->id;
            $carts = Cart::find()->where('userid = :uid', [':uid' => $userid])->asArray()->all();
            foreach($carts as $k=>$pro) {
                $product = Product::find()->where('productid = :pid', [':pid' => $pro['productid']])->one();

SELECT * FROM `shop_product` WHERE istui = "1" and ison = "1" ORDER BY `createtime` DESC LIMIT 3
SELECT * FROM `shop_product` WHERE ison = "1" ORDER BY `createtime` DESC LIMIT 3
SELECT * FROM `shop_product` WHERE ison = "1" and ishot = "1" ORDER BY `createtime` DESC LIMIT 3
SELECT * FROM `shop_product` WHERE ison = "1" and issale = "1" ORDER BY `createtime` DESC LIMIT 3
---
        }
        $this->view->params['cart'] = $data;

        $tui = Product::find()->where('istui = "1" and ison = "1"')->orderby('createtime desc')->limit(3)->all();
        $new = Product::find()->where('ison = "1"')->orderby('createtime desc')->limit(3)->all();
        $hot = Product::find()->where('ison = "1" and ishot = "1"')->orderby('createtime desc')->limit(3)->all();
        $sale = Product::find()->where('ison = "1" and issale = "1"')->orderby('createtime desc')->limit(3)->all();