43_cache_dep/basic/controllers/IndexController.php

    public function actionIndex()
    {
        $this->layout = "layout1";
        $data['tui'] = Product::find()->where('istui = "1" and ison = "1"')->orderby('createtime desc')->limit(4)->all();
        $data['new'] = Product::find()->where('ison = "1"')->orderby('createtime desc')->limit(4)->all();
        $data['hot'] = Product::find()->where('ison = "1" and ishot = "1"')->orderby('createtime desc')->limit(4)->all();
        $data['all'] = Product::find()->where('ison = "1"')->orderby('createtime desc')->limit(7)->all();
---
SELECT * FROM `shop_product` WHERE istui = "1" and ison = "1" ORDER BY `createtime` DESC LIMIT 4
SELECT * FROM `shop_product` WHERE ison = "1" ORDER BY `createtime` DESC LIMIT 4
SELECT * FROM `shop_product` WHERE ison = "1" and ishot = "1" ORDER BY `createtime` DESC LIMIT 4
SELECT * FROM `shop_product` WHERE ison = "1" ORDER BY `createtime` DESC LIMIT 7