45_session_redis/basic/controllers/CartController.php

    public function actionIndex()
    {
        /*if (Yii::$app->session['isLogin'] != 1) {
            return $this->redirect(['member/auth']);
        }
        $userid = User::find()->where('username = :name', [':name' => Yii::$app->session['loginname']])->one()->userid;
         */
        $userid = Yii::$app->user->id;
        $cart = Cart::find()->where('userid = :uid', [':uid' => $userid])->asArray()->all();
---
SELECT * FROM `shop_cart` WHERE userid = '12'