44_select_cache/basic/controllers/CommonController.php

    public function init()
    {
        // 菜单缓存
        $cache = Yii::$app->cache;
        $key = 'menu';
        if (!$menu = $cache->get($key)) {
            $menu = Category::getMenu();
            $cache->set($key, $menu, 3600*2);
        }
        $this->view->params['menu'] = $menu;

        // 购物车缓存
        $key = "cart";
        if (!$data = $cache->get($key)) {
            $data = [];
            $data['products'] = [];
            $total = 0;
            $userid = Yii::$app->user->id;
            $carts = Cart::find()->where('userid = :uid', [':uid' => $userid])->asArray()->all();
            foreach($carts as $k=>$pro) {
                $product = Product::find()->where('productid = :pid', [':pid' => $pro['productid']])->one();
---
SELECT * FROM `shop_cart` WHERE userid = '12'
SELECT * FROM `shop_product` WHERE productid = '27'

            'sql' => 'select max(updatetime) from {{%product}} where ison = "1"',
        ]);
        // 对商品做查询缓存
        $tui = Product::getDb()->cache(function (){
            return Product::find()->where('istui = "1" and ison = "1"')->orderby('createtime desc')->limit(3)->all();
        }, 60, $dep);
        $new = Product::getDb()->cache(function(){
            return Product::find()->where('ison = "1"')->orderby('createtime desc')->limit(3)->all();
        }, 60, $dep);
        $hot = Product::getDb()->cache(function(){
            return Product::find()->where('ison = "1" and ishot = "1"')->orderby('createtime desc')->limit(3)->all();
        }, 60, $dep);
        $sale = Product::getDb()->cache(function(){
            return Product::find()->where('ison = "1" and issale = "1"')->orderby('createtime desc')->limit(3)->all();
---
SELECT * FROM `shop_product` WHERE ison = "1" and issale = "1" ORDER BY `createtime` DESC LIMIT 3
SELECT * FROM `shop_product` WHERE istui = "1" and ison = "1" ORDER BY `createtime` DESC LIMIT 3
SELECT * FROM `shop_product` WHERE ison = "1" ORDER BY `createtime` DESC LIMIT 3
SELECT * FROM `shop_product` WHERE ison = "1" and ishot = "1" ORDER BY `createtime` DESC LIMIT 3